# Дано основи і висоти двох рівнобедрених трапецій. Знайти суму їх
# периметрів. (Визначити функцію для розрахунку периметра рівнобедреної
# трапеції по її основі і висоті).
import math

a1 = int(input('Більша основа трапеції№1: '))
b1 = int(input('Менша основа трапеції№1: '))
c1 = int(input('Висота трапеції№1: '))
a2 = int(input('Більша основа трапеції№2: '))
b2 = int(input('Менша основа трапеції№2: '))
c2 = int(input('Висота трапеції№2: '))


def Perimetr(r, t, y):
    s = math.sqrt(y ** 2 + ((r - t) / 2) ** 2)  # s - бічна сторона
    return r + t + 2 * s


print(Perimetr(a1, b1, c1) + Perimetr(a2, b2, c2))
